{
  "common": {
    "name": "innogy-smarthome",
    "version": "1.2.4",
    "title": "Innogy Smarthome",
    "titleLang": {
      "en": "Innogy Smarthome",
      "de": "Innogy Smarthome",
      "ru": "Innogy Smarthome",
      "pt": "Innogy Smarthome",
      "nl": "Innogy Smarthome",
      "fr": "Innogy Smarthome",
      "it": "Innogy Smarthome",
      "es": "Innogy Smarthome",
      "pl": "Innogy Smarthome",
      "zh-cn": "英诺智能家居",
      "uk": "Innogy Smarthome"
    },
    "license": "MIT",
    "desc": {
      "en": "ioBroker Innogy Smarthome",
      "de": "ioBroker Innogy Smarthome",
      "ru": "ioBroker Innogy Smarthome",
      "pt": "ioBroker Innogy Smarthome",
      "nl": "ioBroker Innogy Smarthome",
      "fr": "ioBroker Innogy Smarthome",
      "it": "ioBroker Innogy Smarthome",
      "es": "ioBroker Innogy Hogar inteligente",
      "pl": "Inteligentny dom ioBroker Innogy",
      "uk": "ioBroker Innogy Smarthome",
      "zh-cn": "ioBroker Innogy 智能家居"
    },
    "news": {
      "1.2.4": {
        "en": "Add shockDetected states\nHandle room enums better for an empty room",
        "de": "Schock hinzufügenDetektierte Staaten\nGriff Zimmer enums besser für ein leeres Zimmer",
        "ru": "Добавить shockDetected состояния\nРучка комнаты лучше для пустой комнаты",
        "pt": "Adicionar estados chocaDetected\nHandle room enums melhor para um quarto vazio",
        "nl": "Vertaling:\nHandelkamer is beter voor een lege kamer",
        "fr": "Ajouter les états protégés\nChambre à main vaut mieux pour une chambre vide",
        "it": "Aggiungi stati di shockDetetto\nManiglia stanza enums meglio per una stanza vuota",
        "es": "Agregar shockDetected states\nLa habitación de la manija es mejor para una habitación vacía",
        "pl": "Add shockDetected States (ang.)\nPomieszczenie ręczne jest lepsze dla pustego pomieszczenia",
        "uk": "Додати шокДетековані стани\nРукоятки кімнати краще за порожній номер",
        "zh-cn": "增加受保护国\n空洞的会议室光明"
      },
      "1.2.3": {
        "en": "Made activeChannel states writable to trigger Alarm\nFixed unit for chargingCurrent",
        "de": "Aktiv gemacht Kanalzustände schreibbar Alarm auslösen\nFeste Einheit zum Aufladen Strom",
        "ru": "Сделано активно Канал говорит, что сигнал тревоги\nФиксированный блок для зарядки Текущие",
        "pt": "Feito ativo Canal estados writable para desencadear alarme\nUnidade fixa para carregamento Corrente",
        "nl": "Ik ben actief. Kanaal staat geschreven om Alarm te activeren\nQuality over Quantity (QoQ) Releases Vertaling: Current",
        "fr": "Fait actif Les états de la Manche peuvent déclencher Alarm\nUnité fixe pour la charge Current",
        "it": "Fatto attivo Stati del canale scrivibile per attivare l'allarme\nUnità fissa per la ricarica Corrente",
        "es": "Hecho activo Los estados del canal son receptibles para desencadenar Alarm\nUnidad fija para la carga Corriente",
        "pl": "Czynny Channel decyduje się na użycie Alarma\nJednostka do ładowania ładunków obecny",
        "uk": "Зроблено активний Каналні стани, які можуть викликати сигналізацію\nФіксований блок для зарядки Головна",
        "zh-cn": "积极参与 海峡州令人感到担忧,可触发Alarm\n索赔单位 目前"
      },
      "1.2.2": {
        "en": "Added missing state definitions (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nPrevented crash cases reported by Sentry",
        "de": "Hinzugefügt fehlende Zustandsdefinitionen (motionDetected, OperatingTimeCurrentWeek, OperatingTimeLastWeek)\nVerhinderte Unfallfälle von Sentry gemeldet",
        "ru": "Добавлены недостающие государственные определения (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nПрофилактические случаи аварии, сообщаемые Сентри",
        "pt": "Adicionados definições de estado ausente (moçãoDetected, operandoTimeCurrentWeek, operandoTimeLastWeek)\nCasos de acidente impedidos relatados por Sentry",
        "nl": "Vermiste staatsdefinities (motie gedetecteerd, opererend TimeCurrent Week, opererend TimeLastweek)\nVertaling:",
        "fr": "Ajout de définitions d'état manquantes (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nCas de crash évités signalés par Sentry",
        "it": "Aggiunto definizioni di stato mancante (motionDetected, operativoTimeCurrentWeek, operativoTimeLastWeek)\nPrevenire casi di crash segnalati da Sentry",
        "es": "Añadido definiciones de estado desaparecidas (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nCasos de choque preventivos reportados por Sentry",
        "pl": "Poniższa definicja państwowa (ukierunkowana, działająca na TimeCurrentWeek)\nPrzygotowanie wypadków spowodowanych przez Sentry",
        "uk": "Додано відсутні визначення стану (motionDetected, OperationTimeCurrentWeek, OperationTimeLastWeek)\nЗапобігли випадки катастрофи, які повідомили Sentry",
        "zh-cn": "添加了失踪的国家定义(拆除、操作的TimeCurrentWeek,操作Time Lastweek)。\nSentry所报告的预防性事故"
      },
      "1.2.1": {
        "en": "Optimize Authentication server handling",
        "de": "Authentication Server-Handling optimieren",
        "ru": "Оптимизация обработки Authentication серверов",
        "pt": "Otimizar o manuseio do servidor de autenticação",
        "nl": "Vertaling:",
        "fr": "Optimiser la manipulation du serveur Authentication",
        "it": "Ottimizzare la gestione del server di autenticazione",
        "es": "Optimize Authentication server handling",
        "pl": "Optimize Authentic Server",
        "uk": "Оптимізація обробки сервера аутентифікації",
        "zh-cn": "利用治疗服务者"
      },
      "1.2.0": {
        "en": "Changed storage of authentication tokens to allow multiple instances on one host (for instance 0)",
        "de": "Geänderte Speicherung von Authentifizierungs-Token, um mehrere Instanzen auf einem Host zu ermöglichen (z.B. 0)",
        "ru": "Изменено хранение токенов аутентификации, чтобы позволить несколько инстанций на одном хосте (например 0)",
        "pt": "Armazenamento alterado de tokens de autenticação para permitir múltiplas instâncias em um host (por exemplo 0)",
        "nl": "Veranderde opslag van authenticatietekens om meerdere instances toe te staan op één gastheer",
        "fr": "Stockage modifié des jetons d'authentification pour permettre plusieurs instances sur un hôte (par exemple 0)",
        "it": "Lo storage modificato dei token di autenticazione per consentire più istanze su un host (ad esempio 0)",
        "es": "Cambio de almacenamiento de fichas de autenticación para permitir múltiples instancias en un host (por ejemplo 0)",
        "pl": "Zmienił magazynowanie tokenów uwierzytelniania, aby umożliwić wielokrotne instancje na jednym gospodarzu (np. 0)",
        "uk": "Змінене зберігання автентифікаційних жетонів, щоб дозволити кілька екземплярів на одному хості (наприклад 0)",
        "zh-cn": "修改核证金的储存,允许在某一东道国发生多种情况(例如0.)。"
      },
      "1.1.2": {
        "en": "Added more missing states for several devices",
        "de": "Weitere fehlende Zustände für mehrere Geräte hinzugefügt",
        "ru": "Добавлено больше пропавших государств для нескольких устройств",
        "pt": "Adicionado mais estados ausentes para vários dispositivos",
        "nl": "Vertaling:",
        "fr": "Ajout d'autres états manquants pour plusieurs appareils",
        "it": "Aggiunto più stati mancanti per diversi dispositivi",
        "es": "Añadido más estados faltantes para varios dispositivos",
        "pl": "Poniższe stany dla kilku urządzeń",
        "uk": "Додано більш відсутні стани для декількох пристроїв",
        "zh-cn": "增加一些装置失踪的国家"
      },
      "1.1.1": {
        "en": "Added crash cases reported by Sentry\nAdded missing ISS2 states",
        "de": "Hinzugefügt Crash Fälle berichtet von Sentry\nHinzugefügt fehlende ISS2 Zustände",
        "ru": "Добавлены случаи сбоя, сообщаемые Sentry\nДобавлены недостающие состояния ISS2",
        "pt": "Adicionado casos de acidente relatados por Sentry\nAdicionado desaparecido ISS2 estados",
        "nl": "Vertaling:\nVertaling:",
        "fr": "Ajout de cas de crash signalés par Sentry\nAjout des états ISS2 manquants",
        "it": "Aggiunto casi di crash segnalati da Sentry\nAggiunto mancanti stati ISS2",
        "es": "Casos de choque adicionales reportados por Sentry\nEstado de ISS2 desaparecido",
        "pl": "Zamknięte przypadki katastrofy odnotowane przez Sentry'a\nZaginięcie ISS2",
        "uk": "Додано випадки аварії, які повідомляються Sentry\nДодано відсутні стани ISS2",
        "zh-cn": "Sentry所报告的更多事故\n增加失踪的IS2州"
      }
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "messagebox": true,
    "subscribe": "messagebox",
    "icon": "innogy-smarthome.png",
    "materialize": true,
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/PArns/ioBroker.innogy-smarthome/master/admin/innogy-smarthome.png",
    "keywords": [
      "innogy-smarthome"
    ],
    "readme": "https://github.com/PArns/ioBroker.innogy-smarthome/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "authors": [
      "Patrick Arns <iobroker@patrick-arns.de>"
    ],
    "tier": 2,
    "connectionType": "cloud",
    "dataSource": "push",
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=4.0.19"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://ed66b18ff0ea4045bd2515b0b7e3b46a@sentry.iobroker.net/227"
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<1.0.0",
            "newVersion>=1.0.0"
          ]
        },
        "title": {
          "en": "Changes in Object structure and local SHC password!",
          "de": "Änderungen in Objektstruktur und lokales SHC-Passwort!",
          "ru": "Изменения в структуре объектов и локальный пароль SHC!",
          "pt": "Alterações na estrutura de objetos e senha local SHC!",
          "nl": "Veranderingen in Object structuur en lokale SHC wachtwoord!",
          "fr": "Changements dans la structure des objets et le mot de passe SHC local!",
          "it": "Modifiche nella struttura degli oggetti e password SHC locale!",
          "es": "Cambios en la estructura de objetos y contraseña local SHC!",
          "pl": "Zmiany w strukturze obiektowej i miejscowym hasło SHC!",
          "uk": "Зміна структури об'єкта та локального пароля SHC!",
          "zh-cn": "目标结构的变化和当地的SHC密码!"
        },
        "text": {
          "en": "This update adds a missing level in the object structure and because of this all Objects IDs will change! Please delete objects before the upgrade or you need to clean it up later. Additionally the local SHC password is now stored encrypted and needs to be re-set in Admin.",
          "de": "Dieses Update fügt eine fehlende Ebene in der Objektstruktur hinzu und dadurch werden alle Objects IDs geändert! Bitte löschen Sie Objekte vor dem Upgrade oder Sie müssen es später reinigen. Zusätzlich wird das lokale SHC-Passwort jetzt verschlüsselt gespeichert und muss in Admin neu eingestellt werden.",
          "ru": "Это обновление добавляет недостающий уровень в структуре объекта и из-за этого все ID объектов изменится! Пожалуйста, удалите объекты до обновления или вам нужно очистить его позже. Дополнительно местный пароль SHC теперь хранится зашифрован и должен быть переустановлен в Admin.",
          "pt": "Esta atualização adiciona um nível ausente na estrutura do objeto e por causa disso todos os IDs de objetos vão mudar! Por favor, exclua objetos antes da atualização ou você precisa limpá-lo mais tarde. Além disso, a senha local do SHC agora é armazenada criptografada e precisa ser redefinida no Admin.",
          "nl": "Deze update voegt een ontbrekend niveau in de objectstructuur en door deze Objects ID's zal alles veranderen! Verwijder objecten voor de upgrade of je moet het later opruimen. De lokale SHC wachtwoord wordt nu gecodeerd en moet opnieuw in Admin worden gezet.",
          "fr": "Cette mise à jour ajoute un niveau manquant dans la structure de l'objet et à cause de cela tous les objets ID vont changer! Veuillez supprimer les objets avant la mise à niveau ou vous devez le nettoyer plus tard. En outre, le mot de passe SHC local est maintenant stocké crypté et doit être réinitialisé dans Admin.",
          "it": "Questo aggiornamento aggiunge un livello mancante nella struttura dell'oggetto e a causa di questo tutti gli ID oggetti cambieranno! Si prega di eliminare gli oggetti prima dell'aggiornamento o è necessario pulire in seguito. Inoltre la password locale SHC viene ora memorizzata crittografata e deve essere riimpostata in Admin.",
          "es": "Esta actualización añade un nivel perdido en la estructura del objeto y debido a esto todos los IDs de Objetos cambiarán! Por favor, eliminar objetos antes de la actualización o necesita limpiarlo más tarde. Además, la contraseña local SHC está ahora almacenada encriptada y necesita ser reiniciada en Admin.",
          "pl": "Ta aktualizacja dodaje brakowy poziom w strukturze obiektu, a z tego wszystkie obiekty będą zmieniać. Wykorzystywanie obiektów przed ulepszaniem lub potrzebą czyścić go w późniejszym czasie. Miejscowe hasło SHC jest obecnie przechowywane zaszyfrowane i musi być ponownie w Admin.",
          "uk": "Цей оновлення додає відсутній рівень у структурі об'єкта і через це всі ідентифікатори об'єктів зміняться! Будь ласка, видаліть об'єкти перед оновленням або потрібно очистити його пізніше. Додатково локальний пароль SHC тепер зберігається зашифровано і потрібно перезавантажити в Адміністратор.",
          "zh-cn": "这一更新增加了目标结构中的缺失水平,因为所有物体的开发会改变! 请删除升级前的物体,或你需要立即予以清理。 此外,当地的SHC密码现在被加密,需要在阿德明重新开始。."
        },
        "link": "TODO",
        "level": "warn",
        "linkText": {
          "en": "More Details see ioBroker Forum (German)",
          "de": "Mehr Details siehe ioBroker Forum",
          "ru": "Подробнее см. форум ioBroker (Немецкий)",
          "pt": "Mais detalhes veja ioBroker Forum (Alemão)",
          "nl": "Meer Details zien ioBroker Forum (German)",
          "fr": "Plus de détails voir ioBroker Forum (allemand)",
          "it": "Maggiori dettagli vedi ioBroker Forum (Tedesco)",
          "es": "Más detalles ver ioBroker Forum (Alemania)",
          "pl": "Więcej informacji na temat ioBroker Forum (Niemcy)",
          "uk": "Детальніше див. ioBroker Forum (Німці)",
          "zh-cn": "详情见io Broker论坛(德国)"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "encryptedNative": [
    "localSHCPassword"
  ],
  "protectedNative": [
    "localSHCPassword"
  ],
  "native": {
    "useLocalSHC": true,
    "localSHCIP": "",
    "localSHCPassword": "",
    "shcGeneration": "2",
    "debug": false,
    "redirectBackPort": 3000
  },
  "objects": []
}
