{
  "common": {
    "name": "innogy-smarthome",
    "version": "1.2.2",
    "title": "Innogy Smarthome",
    "titleLang": {
      "en": "Innogy Smarthome",
      "de": "Innogy Smarthome",
      "ru": "Innogy Smarthome",
      "pt": "Innogy Smarthome",
      "nl": "Innogy Smarthome",
      "fr": "Innogy Smarthome",
      "it": "Innogy Smarthome",
      "es": "Innogy Smarthome",
      "pl": "Innogy Smarthome",
      "zh-cn": "英诺智能家居",
      "uk": "Innogy Smarthome"
    },
    "license": "MIT",
    "desc": {
      "en": "ioBroker Innogy Smarthome",
      "de": "ioBroker Innogy Smarthome",
      "ru": "ioBroker Innogy Smarthome",
      "pt": "ioBroker Innogy Smarthome",
      "nl": "ioBroker Innogy Smarthome",
      "fr": "ioBroker Innogy Smarthome",
      "it": "ioBroker Innogy Smarthome",
      "es": "ioBroker Innogy Hogar inteligente",
      "pl": "Inteligentny dom ioBroker Innogy",
      "uk": "ioBroker Innogy Smarthome",
      "zh-cn": "ioBroker Innogy 智能家居"
    },
    "news": {
      "1.2.2": {
        "en": "Added missing state definitions (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nPrevented crash cases reported by Sentry",
        "de": "Hinzugefügt fehlende Zustandsdefinitionen (motionDetected, OperatingTimeCurrentWeek, OperatingTimeLastWeek)\nVerhinderte Unfallfälle von Sentry gemeldet",
        "ru": "Добавлены недостающие государственные определения (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nПрофилактические случаи аварии, сообщаемые Сентри",
        "pt": "Adicionados definições de estado ausente (moçãoDetected, operandoTimeCurrentWeek, operandoTimeLastWeek)\nCasos de acidente impedidos relatados por Sentry",
        "nl": "Vermiste staatsdefinities (motie gedetecteerd, opererend TimeCurrent Week, opererend TimeLastweek)\nVertaling:",
        "fr": "Ajout de définitions d'état manquantes (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nCas de crash évités signalés par Sentry",
        "it": "Aggiunto definizioni di stato mancante (motionDetected, operativoTimeCurrentWeek, operativoTimeLastWeek)\nPrevenire casi di crash segnalati da Sentry",
        "es": "Añadido definiciones de estado desaparecidas (motionDetected, operatingTimeCurrentWeek, operatingTimeLastWeek)\nCasos de choque preventivos reportados por Sentry",
        "pl": "Poniższa definicja państwowa (ukierunkowana, działająca na TimeCurrentWeek)\nPrzygotowanie wypadków spowodowanych przez Sentry",
        "uk": "Додано відсутні визначення стану (motionDetected, OperationTimeCurrentWeek, OperationTimeLastWeek)\nЗапобігли випадки катастрофи, які повідомили Sentry",
        "zh-cn": "添加了失踪的国家定义(拆除、操作的TimeCurrentWeek,操作Time Lastweek)。\nSentry所报告的预防性事故"
      },
      "1.2.1": {
        "en": "Optimize Authentication server handling",
        "de": "Authentication Server-Handling optimieren",
        "ru": "Оптимизация обработки Authentication серверов",
        "pt": "Otimizar o manuseio do servidor de autenticação",
        "nl": "Vertaling:",
        "fr": "Optimiser la manipulation du serveur Authentication",
        "it": "Ottimizzare la gestione del server di autenticazione",
        "es": "Optimize Authentication server handling",
        "pl": "Optimize Authentic Server",
        "uk": "Оптимізація обробки сервера аутентифікації",
        "zh-cn": "利用治疗服务者"
      },
      "1.2.0": {
        "en": "Changed storage of authentication tokens to allow multiple instances on one host (for instance 0)",
        "de": "Geänderte Speicherung von Authentifizierungs-Token, um mehrere Instanzen auf einem Host zu ermöglichen (z.B. 0)",
        "ru": "Изменено хранение токенов аутентификации, чтобы позволить несколько инстанций на одном хосте (например 0)",
        "pt": "Armazenamento alterado de tokens de autenticação para permitir múltiplas instâncias em um host (por exemplo 0)",
        "nl": "Veranderde opslag van authenticatietekens om meerdere instances toe te staan op één gastheer",
        "fr": "Stockage modifié des jetons d'authentification pour permettre plusieurs instances sur un hôte (par exemple 0)",
        "it": "Lo storage modificato dei token di autenticazione per consentire più istanze su un host (ad esempio 0)",
        "es": "Cambio de almacenamiento de fichas de autenticación para permitir múltiples instancias en un host (por ejemplo 0)",
        "pl": "Zmienił magazynowanie tokenów uwierzytelniania, aby umożliwić wielokrotne instancje na jednym gospodarzu (np. 0)",
        "uk": "Змінене зберігання автентифікаційних жетонів, щоб дозволити кілька екземплярів на одному хості (наприклад 0)",
        "zh-cn": "修改核证金的储存,允许在某一东道国发生多种情况(例如0.)。"
      },
      "1.1.2": {
        "en": "Added more missing states for several devices",
        "de": "Weitere fehlende Zustände für mehrere Geräte hinzugefügt",
        "ru": "Добавлено больше пропавших государств для нескольких устройств",
        "pt": "Adicionado mais estados ausentes para vários dispositivos",
        "nl": "Vertaling:",
        "fr": "Ajout d'autres états manquants pour plusieurs appareils",
        "it": "Aggiunto più stati mancanti per diversi dispositivi",
        "es": "Añadido más estados faltantes para varios dispositivos",
        "pl": "Poniższe stany dla kilku urządzeń",
        "uk": "Додано більш відсутні стани для декількох пристроїв",
        "zh-cn": "增加一些装置失踪的国家"
      },
      "1.1.1": {
        "en": "Added crash cases reported by Sentry\nAdded missing ISS2 states",
        "de": "Hinzugefügt Crash Fälle berichtet von Sentry\nHinzugefügt fehlende ISS2 Zustände",
        "ru": "Добавлены случаи сбоя, сообщаемые Sentry\nДобавлены недостающие состояния ISS2",
        "pt": "Adicionado casos de acidente relatados por Sentry\nAdicionado desaparecido ISS2 estados",
        "nl": "Vertaling:\nVertaling:",
        "fr": "Ajout de cas de crash signalés par Sentry\nAjout des états ISS2 manquants",
        "it": "Aggiunto casi di crash segnalati da Sentry\nAggiunto mancanti stati ISS2",
        "es": "Casos de choque adicionales reportados por Sentry\nEstado de ISS2 desaparecido",
        "pl": "Zamknięte przypadki katastrofy odnotowane przez Sentry'a\nZaginięcie ISS2",
        "uk": "Додано випадки аварії, які повідомляються Sentry\nДодано відсутні стани ISS2",
        "zh-cn": "Sentry所报告的更多事故\n增加失踪的IS2州"
      },
      "1.1.0": {
        "en": "Prevented crash cases when setting values is not successful\nAdded more missing states\nAdded Sentry for Crash reporting and missing state reporting",
        "de": "Verhinderte Crashfälle, wenn Werte nicht erfolgreich eingestellt werden\nMehr fehlende Staaten\nSentry für Crash Reporting und fehlende Staatsberichterstattung hinzugefügt",
        "ru": "Предотвращаемые случаи сбоя при установлении ценностей не успешны\nДобавлено больше пропавших государств\nДобавлена служение для Crash отчетности и отсутствующей государственной отчетности",
        "pt": "Casos de acidente impedidos ao definir valores não é bem-sucedido\nAdicionado mais estados desaparecidos\nAdicionado Sentry para relatórios Crash e relatórios de estado desaparecido",
        "nl": "Voorbedachte crash gevallen als het plaatsen van waarden niet succesvol is\nVertaling:\nVertaling:",
        "fr": "Cas d ' accident évités lorsqu ' il n ' y a pas de valeur\nAjout d'autres états manquants\nA ajouté Sentry for Crash reporting and missing state reporting",
        "it": "Prevenire casi di crash quando l'impostazione dei valori non è riuscita\nAggiunto più Stati mancanti\nAggiunto Sentry for Crash reporting e mancante stato reporting",
        "es": "Casos de choque evitados cuando el ajuste de valores no es exitoso\nAñadido más estados desaparecidos\nSentry añadido para reportaje de Crash y reportaje de estado desaparecido",
        "pl": "Przygotowania do katastrofy, gdy ustawienie wartości nie jest skuteczne\nWprowadzone są także stany zaginionych\nDodał Sentry for Crash report and missing state report (ang.)",
        "uk": "Запобігання випадкових випадків при встановленні значень не вдало\nДодано більше відсутніх штатів\nДодана птиця для звітування Crash та відсутності державної звітності",
        "zh-cn": "在确定价值不成功时,预防性事故\n增加更多失踪国家\n增加事故报告和失踪国家报告的待命状态"
      },
      "1.0.0": {
        "en": "IMPORTANT: This updates introduces a new object ID level as Channel, so all Object-IDs will change!\nIMPORTANT: The local SHC Password needs to be re-entered in Admin!\nAdded support for local connections to SHC Classic/Generation 1\nAdded lowBattery and isReachable states and Message support to update them\nAdded option to configure the port for the redirect back server for OAuth with cloud connection (default 3000)\nAdd more missing states\nGeneral updates and optimizations",
        "de": "WICHTIG: Diese Updates stellen eine neue Objekt-ID-Ebene als Channel vor, so dass sich alle Object-IDs ändern!\nWICHTIG: Das lokale SHC-Passwort muss in Admin neu eingelesen werden!\nUnterstützung für lokale Verbindungen zu SHC Classic/Generation 1\nHinzugefügt lowBattery und isReachable Zustände und Nachrichten-Unterstützung, um sie zu aktualisieren\nOption zur Konfiguration des Ports für den Redirect Back Server für OAuth mit Cloud-Verbindung (Standard 3000)\nWeitere fehlende Staaten hinzufügen\nAllgemeine Updates und Optimierungen",
        "ru": "ВАЖНО: Это обновление вводит новый уровень ID объекта в качестве канала, поэтому все ID объекта изменится!\nВАЖНО: Местный пароль SHC должен быть повторно введен в Admin!\nДобавлена поддержка местных подключений к SHC Classic/Generation 1\nДобавлены lowBattery и доступные государства и поддержка сообщений, чтобы обновить их\nДобавлена возможность настройки порта для перенаправления обратного сервера для OAuth с облачным подключением (по умолчанию 3000)\nДобавить больше пропавших государств\nОбщие обновления и оптимизация",
        "pt": "IMPORTANTE: Esta atualização introduz um novo nível de ID de objeto como Canal, então todos os Object-IDs vão mudar!\nIMPORTANTE: A senha local do SHC precisa ser reinserida no Admin!\nAdicionado suporte para conexões locais para SHC Classic/Generation 1\nAdicionado lowBattery e isReachable estados e suporte de mensagem para atualizá-los\nOpção adicionada para configurar a porta para o servidor de redirecionamento para OAuth com conexão em nuvem (padrão 3000)\nAdicionar mais estados desaparecidos\nAtualizações e otimizações gerais",
        "nl": "Deze updates introduceren een nieuw object ID-niveau als Channel, dus alle Object-IDs zullen veranderen!\nHet lokale SHC wachtwoord moet in Admin hergebruikt worden!\nOndersteuning voor lokale connecties met SHC Classic/Generatie 1\nGevoegd met lage boterie en onherstelbare staten en Message steun om ze te updaten\nToegevoegd optie om de haven te configureren voor de terugleidende server voor OAuth met wolkverbinding (default 3000)\nVoeg meer vermiste staten toe\nAlgemene updates en optimatie",
        "fr": "IMPORTANT: Cette mise à jour introduit un nouveau niveau d'identification d'objet comme Channel, donc tous les objets-IDs changeront!\nIMPORTANT: Le mot de passe SHC local doit être réintégré dans Admin!\nAjout du support pour les connexions locales à SHC Classic/Generation 1\nAjouté basBattery et est états disponibles et soutien de message pour les mettre à jour\nAjout d'option pour configurer le port pour le serveur arrière redirigé pour OAuth avec connexion cloud (par défaut 3000)\nAjouter d'autres états manquants\nMises à jour et optimisations générales",
        "it": "IMPORTANTE: Questo aggiornamento introduce un nuovo livello ID oggetto come Canale, così tutti gli Object-ID cambieranno!\nIMPORTANTE: La password locale SHC deve essere ri-entrata in Admin!\nAggiunto il supporto per le connessioni locali a SHC Classic/Generation 1\nAggiunto LowBattery e isReachable stati e supporto messaggio per aggiornarli\nAggiunta opzione per configurare la porta per il server di retro reindirizzamento per OAuth con connessione cloud (default 3000)\nAggiungi altri stati mancanti\nAggiornamenti e ottimizzazioni generali",
        "es": "IMPORTANTE: Esta actualización introduce un nuevo nivel de identificación de objetos como Canal, por lo que todos los Object-IDs cambiarán!\nIMPORTANTE: ¡La contraseña local SHC necesita ser reiniciada en Admin!\nApoyo añadido a las conexiones locales con SHC Classic/Generation 1\nAñadido bajoBattery y esReachable estados y soporte de Mensaje para actualizarlos\nOpción agregada para configurar el puerto para el servidor de redirigir hacia atrás para OAuth con conexión en la nube (por defecto 3000)\nAñadir más estados perdidos\nActualizaciones y optimizaciones generales",
        "pl": "IMPORTANT: Ta aktualizacja wprowadza nowy poziom ID jako kanał, więc wszystkie obiekty będą zmieniać!\nIMPORTANT: Miecz SHC musi być ponownie włączony do Admin!\nWsparcie dla lokalnych połączeń do SHC Classic/Generation 1\nDodany do niskobaterii i jest odpowiednim stanem i wsparciem Message'a do aktualizacji ich\nDodano możliwość konfigurowania portu dla serwera OAuth z połączenia chmur (default 3000)\nAddd\nGeneral aktualizacja i optymalizacja",
        "uk": "ВАЖЛИВО: Це оновлення вводить новий рівень ідентифікатор об'єкта як канал, тому всі об'єкти зміняться!\nВАЖЛИВО: локальний пароль SHC повинен бути повторним!\nДодано підтримку локальних підключень до SHC Classic/Generation 1\nДодана низькаБаттерія і єдоступними державами і підтримкою повідомлень для оновлення їх\nДодано опцію для налаштування порту для переадресного сервера для OAuth з хмарним підключенням (default 3000)\nДодати більше відсутніх штатів\nЗагальні оновлення та оптимізація",
        "zh-cn": "IMPORTANT:这一最新消息引入了作为海峡的新目标ID级,因此所有物体-开发公司都将改变!\nIMPORTANT:当地SHC护照密码需要重新进入Admin!\nB. 增加对初级保健/工资的当地联系的支助 1\n增加低巴特,是可偿还的州和梅斯支助,以更新它们。\n增加改装OAuth的转导服务器的港口(Deefault 3000)\n增加更多失踪国家\n一般性更新和优化"
      }
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "messagebox": true,
    "subscribe": "messagebox",
    "icon": "innogy-smarthome.png",
    "materialize": true,
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/PArns/ioBroker.innogy-smarthome/master/admin/innogy-smarthome.png",
    "keywords": [
      "innogy-smarthome"
    ],
    "readme": "https://github.com/PArns/ioBroker.innogy-smarthome/blob/master/README.md",
    "loglevel": "info",
    "type": "iot-systems",
    "authors": [
      "Patrick Arns <iobroker@patrick-arns.de>"
    ],
    "tier": 2,
    "connectionType": "cloud",
    "dataSource": "push",
    "dependencies": [
      {
        "js-controller": ">=2.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=4.0.19"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://ed66b18ff0ea4045bd2515b0b7e3b46a@sentry.iobroker.net/227"
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<1.0.0",
            "newVersion>=1.0.0"
          ]
        },
        "title": {
          "en": "Changes in Object structure and local SHC password!",
          "de": "Änderungen in Objektstruktur und lokales SHC-Passwort!",
          "ru": "Изменения в структуре объектов и локальный пароль SHC!",
          "pt": "Alterações na estrutura de objetos e senha local SHC!",
          "nl": "Veranderingen in Object structuur en lokale SHC wachtwoord!",
          "fr": "Changements dans la structure des objets et le mot de passe SHC local!",
          "it": "Modifiche nella struttura degli oggetti e password SHC locale!",
          "es": "Cambios en la estructura de objetos y contraseña local SHC!",
          "pl": "Zmiany w strukturze obiektowej i miejscowym hasło SHC!",
          "uk": "Зміна структури об'єкта та локального пароля SHC!",
          "zh-cn": "目标结构的变化和当地的SHC密码!"
        },
        "text": {
          "en": "This update adds a missing level in the object structure and because of this all Objects IDs will change! Please delete objects before the upgrade or you need to clean it up later. Additionally the local SHC password is now stored encrypted and needs to be re-set in Admin.",
          "de": "Dieses Update fügt eine fehlende Ebene in der Objektstruktur hinzu und dadurch werden alle Objects IDs geändert! Bitte löschen Sie Objekte vor dem Upgrade oder Sie müssen es später reinigen. Zusätzlich wird das lokale SHC-Passwort jetzt verschlüsselt gespeichert und muss in Admin neu eingestellt werden.",
          "ru": "Это обновление добавляет недостающий уровень в структуре объекта и из-за этого все ID объектов изменится! Пожалуйста, удалите объекты до обновления или вам нужно очистить его позже. Дополнительно местный пароль SHC теперь хранится зашифрован и должен быть переустановлен в Admin.",
          "pt": "Esta atualização adiciona um nível ausente na estrutura do objeto e por causa disso todos os IDs de objetos vão mudar! Por favor, exclua objetos antes da atualização ou você precisa limpá-lo mais tarde. Além disso, a senha local do SHC agora é armazenada criptografada e precisa ser redefinida no Admin.",
          "nl": "Deze update voegt een ontbrekend niveau in de objectstructuur en door deze Objects ID's zal alles veranderen! Verwijder objecten voor de upgrade of je moet het later opruimen. De lokale SHC wachtwoord wordt nu gecodeerd en moet opnieuw in Admin worden gezet.",
          "fr": "Cette mise à jour ajoute un niveau manquant dans la structure de l'objet et à cause de cela tous les objets ID vont changer! Veuillez supprimer les objets avant la mise à niveau ou vous devez le nettoyer plus tard. En outre, le mot de passe SHC local est maintenant stocké crypté et doit être réinitialisé dans Admin.",
          "it": "Questo aggiornamento aggiunge un livello mancante nella struttura dell'oggetto e a causa di questo tutti gli ID oggetti cambieranno! Si prega di eliminare gli oggetti prima dell'aggiornamento o è necessario pulire in seguito. Inoltre la password locale SHC viene ora memorizzata crittografata e deve essere riimpostata in Admin.",
          "es": "Esta actualización añade un nivel perdido en la estructura del objeto y debido a esto todos los IDs de Objetos cambiarán! Por favor, eliminar objetos antes de la actualización o necesita limpiarlo más tarde. Además, la contraseña local SHC está ahora almacenada encriptada y necesita ser reiniciada en Admin.",
          "pl": "Ta aktualizacja dodaje brakowy poziom w strukturze obiektu, a z tego wszystkie obiekty będą zmieniać. Wykorzystywanie obiektów przed ulepszaniem lub potrzebą czyścić go w późniejszym czasie. Miejscowe hasło SHC jest obecnie przechowywane zaszyfrowane i musi być ponownie w Admin.",
          "uk": "Цей оновлення додає відсутній рівень у структурі об'єкта і через це всі ідентифікатори об'єктів зміняться! Будь ласка, видаліть об'єкти перед оновленням або потрібно очистити його пізніше. Додатково локальний пароль SHC тепер зберігається зашифровано і потрібно перезавантажити в Адміністратор.",
          "zh-cn": "这一更新增加了目标结构中的缺失水平,因为所有物体的开发会改变! 请删除升级前的物体,或你需要立即予以清理。 此外,当地的SHC密码现在被加密,需要在阿德明重新开始。."
        },
        "link": "TODO",
        "level": "warn",
        "linkText": {
          "en": "More Details see ioBroker Forum (German)",
          "de": "Mehr Details siehe ioBroker Forum",
          "ru": "Подробнее см. форум ioBroker (Немецкий)",
          "pt": "Mais detalhes veja ioBroker Forum (Alemão)",
          "nl": "Meer Details zien ioBroker Forum (German)",
          "fr": "Plus de détails voir ioBroker Forum (allemand)",
          "it": "Maggiori dettagli vedi ioBroker Forum (Tedesco)",
          "es": "Más detalles ver ioBroker Forum (Alemania)",
          "pl": "Więcej informacji na temat ioBroker Forum (Niemcy)",
          "uk": "Детальніше див. ioBroker Forum (Німці)",
          "zh-cn": "详情见io Broker论坛(德国)"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "encryptedNative": [
    "localSHCPassword"
  ],
  "protectedNative": [
    "localSHCPassword"
  ],
  "native": {
    "useLocalSHC": true,
    "localSHCIP": "",
    "localSHCPassword": "",
    "shcGeneration": "2",
    "debug": false,
    "redirectBackPort": 3000
  },
  "objects": []
}
